Repository: unoplatform/Uno.Samples
Catalog: generative/electric-utility-dashboard/app/GridWatch/Strings/*/Resources.resw
Source language: en
Languages: es, fr, pt_br

# DashboardNavItem.Content
source: Dashboard
es: Panel
fr: Tableau de bord
pt_br: Painel

# DashboardNavItem.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Dashboard navigation item
es: Elemento de navegación del panel
fr: Élément de navigation du tableau de bord
pt_br: Item de navegação do painel

# GridMapNavItem.Content
source: Grid Map
es: Mapa de red
fr: Carte du réseau
pt_br: Mapa da rede

# GridMapNavItem.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Grid Map navigation item
es: Elemento de navegación del mapa de red
fr: Élément de navigation de la carte du réseau
pt_br: Item de navegação do mapa da rede

# AlertsNavItem.Content
source: Alerts
es: Alertas
fr: Alertes
pt_br: Alertas

# AlertsNavItem.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Alerts navigation item
es: Elemento de navegación de alertas
fr: Élément de navigation des alertes
pt_br: Item de navegação de alertas

# LoginPage_Subtitle.Text
source: Electric Utility Operations
es: Operaciones de servicios eléctricos
fr: Opérations des services électriques
pt_br: Operações de serviços elétricos

# LoginPage_UsernameLabel.Text
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
pt_br: Nome de usuário

# UsernameBox.PlaceholderText
source: Enter username
es: Ingrese nombre de usuario
fr: Entrez le nom d'utilisateur
pt_br: Digite o nome de usuário

# UsernameBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
pt_br: Nome de usuário

# LoginPage_PasswordLabel.Text
source: Password
es: Contraseña
fr: Mot de passe
pt_br: Senha

# PasswordBox.PlaceholderText
source: Enter password
es: Ingrese contraseña
fr: Entrez le mot de passe
pt_br: Digite a senha

# PasswordBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Password
es: Contraseña
fr: Mot de passe
pt_br: Senha

# SignInButton.Content
source: Sign In
es: Iniciar sesión
fr: Se connecter
pt_br: Entrar

# SignInButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Sign In
es: Iniciar sesión
fr: Se connecter
pt_br: Entrar

# DemoCredentialsHint.Text
source: Demo credentials: admin / grid2024
es: Credenciales de demostración: admin / grid2024
fr: Identifiants de démonstration : admin / grid2024
pt_br: Credenciais de demonstração: admin / grid2024

# Dashboard_Title.Text
source: Operations Dashboard
es: Panel de operaciones
fr: Tableau de bord des opérations
pt_br: Painel de operações

# Dashboard_Subtitle.Text
source: Grid Status: All Systems Nominal
es: Estado de la red: todos los sistemas nominales
fr: État du réseau : tous les systèmes nominaux
pt_br: Status da rede: todos os sistemas nominais

# ToggleThemeButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Toggle theme
es: Cambiar tema
fr: Changer de thème
pt_br: Alternar tema

# FacilitiesHeader.Text
source: Facilities
es: Instalaciones
fr: Installations
pt_br: Instalações

# ActiveAlertsHeader.Text
source: Active Alerts
es: Alertas activas
fr: Alertes actives
pt_br: Alertas ativas

# GridMap_Title.Text
source: Grid Infrastructure Map
es: Mapa de infraestructura de la red
fr: Carte de l'infrastructure du réseau
pt_br: Mapa de infraestrutura da rede

# GridMap_Subtitle.Text
source: All registered facilities and their current status
es: Todas las instalaciones registradas y su estado actual
fr: Toutes les installations enregistrées et leur état actuel
pt_br: Todas as instalações registradas e seu status atual

# FacilityColumnHeader.Text
source: FACILITY
es: INSTALACIÓN
fr: INSTALLATION
pt_br: INSTALAÇÃO

# RegionColumnHeader.Text
source: REGION
es: REGIÓN
fr: RÉGION
pt_br: REGIÃO

# TypeColumnHeader.Text
source: TYPE
es: TIPO
pt_br: TIPO

# CapacityColumnHeader.Text
source: CAPACITY
es: CAPACIDAD
fr: CAPACITÉ
pt_br: CAPACIDADE

# OutputColumnHeader.Text
source: OUTPUT
es: PRODUCCIÓN
fr: PRODUCTION
pt_br: PRODUÇÃO

# StatusColumnHeader.Text
source: STATUS
es: ESTADO
fr: STATUT

# Alerts_Title.Text
source: System Alerts
es: Alertas del sistema
fr: Alertes système
pt_br: Alertas do sistema

# FilterLabel.Text
source: Filter:
es: Filtro:
fr: Filtre :
pt_br: Filtro:

# FilterAllButton.Content
source: All
es: Todas
fr: Toutes
pt_br: Todas

# FilterAllButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Filter all alerts
es: Filtrar todas las alertas
fr: Filtrer toutes les alertes
pt_br: Filtrar todas as alertas

# FilterCriticalButton.Content
source: Critical
es: Críticas
fr: Critiques
pt_br: Críticas

source: Filter critical alerts
es: Filtrar alertas críticas
fr: Filtrer les alertes critiques
pt_br: Filtrar alertas críticas

# FilterWarningButton.Content
source: Warning
es: Advertencia
fr: Avertissement
pt_br: Aviso

source: Filter warning alerts
es: Filtrar alertas de advertencia
fr: Filtrer les alertes d'avertissement
pt_br: Filtrar alertas de aviso

# FilterInfoButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Filter info alerts
es: Filtrar alertas informativas
fr: Filtrer les alertes d'information
pt_br: Filtrar alertas informativas
